[
  {
    "path": "posts/welcome/",
    "title": "Visual Analytics Project",
    "description": "Proposal of data visualization analytics project.",
    "author": [
      {
        "name": "ISSS608 G2 T6",
        "url": "https://wiki.smu.edu.sg/1516t3isss608g1/Course_information"
      }
    ],
    "date": "2021-06-17",
    "categories": [],
    "contents": "\r\n1. Motivation\r\nIn January 2014, several employees of GAStech went missing while leaders of GAStech are celebrating for company’s initial public offering. Because GAStech has not been good at environment management while producing natural gas, an organization is suspected of this disappearance. To find out the truth of this case, we should analyze GAStech’s employees’ activities to find out any suspicious clue and crime suspect.\r\nTo achieve this, our group used visualization techniques: maps, pie charts, line graphs and interactions to provide insights of employees’ shopping habit, relationship network and abnormal behaviors relating to disappearance.\r\n2. Problem& Issue\r\nIn the kidnapping case of GAStech company employees in Kronos, we aim to find the abnormal facts that may be related to this case by data visualization. In detail, our group plan to conduct an in-depth investigation through Mini-challenge2 by analyzing their credit card transactions, loyalty card usage and vehicle tracking data to address these issues below:\r\nAnalyzing credit and loyalty card data, identify the most popular locations and most popular time to find out anomalies and carried out some measures to correct them.\r\nVisualize the vehicle tracking data to get the vehicle trajectory and analyze those abnormal routes.\r\nMap the vehicle data to the analysis of credit and loyalty card data to locate the discrepancies and ownership between them.\r\nAnalyzing the life pattern among GASTech personnel to identify potential informal or unofficial relationships among them, adding in their email data in MC1 if necessary.\r\nCombined with the above analysis, dig out suspicious activities may be related to this kidnapping case and located suspicious locations kidnapping might happen.\r\n3. Relevant work\r\nWork Scope\r\nPrincipal\r\nData cleansing and preparation\r\nZhang Xinru\r\nCredit Card analysis by RFM model, Market Basket Analysis\r\nZhang Xinru\r\nLoyalty Card analysis\r\nZhang Xinru\r\nMapping of Loyalty Card to Credit Card\r\nZhong Ping\r\nSocial Analysis for GASTech personnel\r\nZhong Ping\r\nGeographic visualization of vehicle tracking\r\nMiao Lu\r\nOwnership analysis of vehicle, credit card and loyalty card\r\nMiao Lu\r\nText analysis of staff email\r\nMiao Lu\r\nSuspicious activities analysis\r\nZhong Ping\r\nApplication build\r\nAll members\r\n4.Approach & Methodology\r\n4.1 Visualization\r\nThe possible visualization methods we are possibly using the graph shown below.\r\nPlot\r\nDescription\r\nGeospatial map\r\nTo navigate how the pace change over time and the distribution of different car.\r\nPie chart\r\nTo observe categorical distribution of employees, stores.\r\nScatter plot\r\nTo show the size of sales.\r\nLine plot\r\nTo plot the sale changes over time.\r\nHeatmap\r\nTo observe the relationship between 2 variables\r\n4.2 Rstudio\r\nR studio is the main tool that we are using to achieve the interaction. The packages that we may use include:\r\nPackage\r\nDescription\r\nR shiny\r\nTo create the interactive application\r\ntidyverse\r\nData processing and Data wrangling\r\nleaflet\r\nTo create interactive map\r\nggplot2\r\nTo plot the graph\r\ngrid\r\nTo add annotation\r\ndplyr\r\nFor data manipulation\r\n5. Storyboard\r\nIn order to draw conclusive relationships and results. We propose to develop some graph in Shiny R to visualize these relationships:\r\n5.1 Geospatial map of cars driving\r\n Tab 1 aims to keep track of employees’ path over past 14 days. The features of map should include: * Interactive (car ID, time) * Able to distinguish the place. So far, we found some insights which may be useful in the future. 1.ID15 and ID16 live the same place. And they went to a place at 3AM several times. 2. ID4 and ID10 went to the company earlier than others and they liked to have a breakfast together.\r\n5.2 Pie chart of GAStech department\r\n\r\nTab 2 is the pie chart type of distribution, aiming to see the relationship of each employee in the working environment. This type of relationship can be combined with other graph to do some further analysis or make appropriate assumption.For example, from the graph we can see that id 4 and id 10 is from executive department, so this observation may explain why they always go to the company earlier than others.\r\n5.3 Scatter plot of each store\r\n\r\nThe scatter plot can be used to see if there are some abnormal purchases happened over last 14 days, the size of circle can represent the sales that day. And comparing to the size of circle each day we can find the normal sales and then get the abnormal one. In this graph, we also need to implement interaction in the future to observe specific store.\r\n5.4 Line chart for sales and number of purchases\r\n\r\nLine chart is a very useful graph to see the changes of sales over time. The first line chart is to show the sales changes in each store and the second one talks about the times of purchased each store occur. Combining 2 chart would be better to find out the abnormal purchase. The chart also needs to be interactive to select particular store which may be related to the suspects.\r\n5.5 Abnormal Mapping between Ccnum and Loyaltynum\r\n This dashboard combines a line chart and a density graph. The density graph showing two abnormal mapping between employee’s credit card and employee’s loyalty card, which means credit cards ending with “1310” and “4795” are sharing two loyalty cards. The line graph shows transaction history of the two suspicious credit/debit card to help further find out the relationship between owners of “1310” and “4785”.\r\n6. Project Timeline\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-20T22:00:25+08:00",
    "input_file": "welcome.knit.md"
  }
]
